In [2]:
import pandas as pd
import numpy as np

from pathlib import Path

data_path= Path("./data")

df = pd.read_csv(data_path / 'house.csv')
df.head(2)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.5,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.5,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA

In [5]:
df['price_grp']=pd.qcut(x= df['price'], q=5,labels=np.arange(0,5))
df['price_grp']

0       1
1       4
2       1
3       2
4       3
       ..
4595    1
4596    3
4597    2
4598    0
4599    0
Name: price_grp, Length: 4600, dtype: category
Categories (5, int64): [0 < 1 < 2 < 3 < 4]

In [9]:
df.isna().sum()

date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
price_grp        0
dtype: int64

In [10]:
data['price'].mean()

551962.9884732141

In [20]:
df1 = data.groupby('condition').agg({
    'bathrooms' : 'mean',
    'floors' : 'mean'
})
df2 = data.query('price>0').groupby('condition').agg({
    'price' : [np.max,np.min]
})


df3 = pd.concat([df1,df2],axis=1)
df3

           bathrooms    floors  (price, amax)  (price, amin)
condition
1           1.166667  1.083333       550000.0         7800.0
2           1.437500  1.156250      2555000.0        80000.0
3           2.276957  1.651130     12899000.0        83000.0
4           1.935903  1.277157     26590000.0        83300.0
5           2.107471  1.301149      3200000.0        83300.0